Revit 2024 API
CurtainGrid Class
Represents a curtain grid element within Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class CurtainGrid : APIObject
Visual Basic
Public Class CurtainGrid _
	Inherits APIObject
Visual C++
public ref class CurtainGrid : public APIObject
Remarks
This element is obtained from a curtain wall, curtain system, or curtain roof. A curtain wall has only one curtain grid, while a curtain system or curtain roof may have several curtain grids.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.CurtainGrid
See Also
CurtainGrid Members
Autodesk.Revit.DB Namespace